[{"id": 1, "title": "Chapter 1: The Mandalorian", "description": "Pięć lat po pokonaniu Imperium, mandaloriański łowca nagród akceptuje lukratywne zlecenie od klienta z imperialnymi powiązaniami. Jego celem jest pięćdziesięcioletnia osoba, przebywająca na pustynnej planecie Arvala-7. Klient jest obojętny na dobro celu, jednak obecny przy rozmowie dr Pershing nalega, aby uniknąć jego śmierci. W ramach zadatku łowca otrzymuje sztabkę stali beskarskiej, z której potem płatnerz tworzy naramiennik. Po wylądowaniu na planecie, Mandalorianin zostaje zaatakowany przez dwa blurggry. Ratuje go farmer o imieniu Kuiil, który pomaga mu dotrzeć do pilnie strzeżonego celu. Wszyscy jego poprzednicy zginęli, próbując zrealizować zadanie, lecz łowca nagród oczyszcza obóz z pomocą droida zabójcy IG-11. Celem okazuje się niemowlę pochodzące z tego samego gatunku, co Yoda. Gdy IG-11 próbuje je zabić, Mandalorianin niszczy robota.", "viewed": true}, {"id": 2, "title": "Chapter 2: The Child", "description": "Mandalorianin eskortuje niemowlę na swój statek. W trakcie wędrówki zostaje zaatakowany przez najemników, którzy próbują przejąć cel. Gdy mężczyzna wraz z dzieckiem dociera do pojazdu, okazuje się, że istoty z gatunku Jawa rozkradają jego statek, rozbierając go na części. Mandalorianin przepłasza ich, a Jawowie uciekają do swojego pojazdu - piaskoczołgu. Następnego dnia Kuiil pomaga łowcy nagród w odzyskaniu elementów statku. W zamian mężczyzna musi zapolować na „jajo”, aby zapłacić istotom za swoje własne części. Mandalorianin wraz z niemowlęciem udaje się do jaskini, w której mieszka duża, rogata bestia. Walka łowcy nagród nie przebiega najlepiej, ale ostatecznie zielone niemowlę używa mocy, unieruchamiając zwierzę. Dzięki temu mężczyźnie udaje się je zabić. Po odebraniu od Jawów części, Mandalorianin i Kuill naprawiają statek. Łowca nagród, wraz ze zdobytym celem, opuszcza planetę.", "viewed": true}, {"id": 3, "title": "Chapter 3: The Sin", "description": "Mandalorianin przekazuje dziecko Klientowi, bezskutecznie próbując zdobyć informacje dotyczące przyszłości malca. W zamian łowca nagród dostaje więcej beskaru, który wykorzystuje do pełnego ulepszenia swej zbroi, po czym idzie do Greefa Cargi po kolejne zlecenie. Zamiast jednak je wykonać, wraca po dziecko. Udaje mu się je przejąć, jednak zostaje zaatakowany przez innych łowców nagród. Dzięki pomocy pozostałych Mandalorian mężczyzna ucieka z planety wraz z malcem.", "viewed": true}, {"id": 4, "title": "Chapter 4: Sanctuary", "description": "Uciekając przed Gildią, Mandalorianin udaje się na słabo zaludnioną planetę Sorgan. Tam spotyka najemniczkę, byłą członkinię Rebelii – Carę Dune, która ukrywa się przed łowcami nagród. Dwaj zdesperowani rybacy proszą Mandalorianina, aby pomógł im pozbyć się lokalnej bandy rzezimieszków. Razem z Carą i dzieckiem, Mandalorianin jedzie do ich wioski. Okazuje się, że zbrodniarze posiadają imperialną maszynę kroczącą AT-ST. Dune i Mandalorianin szkolą w walce wieśniaków i przygotowują zasadzkę. Po zmroku prowokują najeźdźców, a AT-ST zwabiają nad staw, gdzie jest przygotowana pułapka. AT-ST wpada do wody, gdzie zostaje wysadzone w powietrze. Mandalorianin planuje zostawić niemowlę w wiosce i opuścić planetę. Łowca nagród z Gildii próbuje zabić dziecko, ale w ostatniej chwili zostaje powstrzymany przez Carę. Mandalorianin i niemowlę opuszczają wioskę.", "viewed": true}, {"id": 5, "title": "Chapter 5: The Gunslinger", "description": "Statek Mandalorianina ścigany jest przez łowcę nagród. Dochodzi do strzelaniny, w której ginie łowca. Mandalorianin ląduje swoim uszkodzonym statkiem w pobliskim doku naprawczym, prowadzonym przez Peli Motto w Mos Eisley na Tatooine. Poszukuje pracy w kantynie, aby zapłacić za naprawy. Tam poznaje Toro Calicana – młodego chłopaka, którego marzeniem jest dostanie się do Gildii Łowców Nagród. Mandalorianin zgadza się pomóc Calicanowi w pojmaniu zabójczyni Fennec Shand. Od niej Toro dowiaduje się, że Mandalorianin jest najbardziej poszukiwaną osobą w Gildii. Chłopak zabija Shand i udaje się do doku. Bierze za zakładniczkę Peli Moto i Dziecko. Mandalorianin zabija go. Na pustyni tajemnicza postać zbliża się do ciała Shand.", "viewed": true}, {"id": 6, "title": "Chapter 6: The Prisoner", "description": "Mandalorianin udaje się na stację kosmiczną i przyjmuje ofertę pracy od swojego dawnego znajomego – Rana. Dołącza do Mayfielda – byłego snajpera Imperium, Burga – devaroniańskiego siłacza, droida-pilota Zero oraz Twi'lekanki Xi'an w misji uratowania więźnia Nowej Republiki. Ekipie udaje się uwolnić Qina – brata Xi'an, lecz ci włączają alarm. Mandalorianin zostaje zdradzony i zamknięty w celi. Udaje mu się z niej wydostać i eliminuje po kolei zdrajców. Razem z Quinem uciekają na platformę Rana. Były znajomy płaci Mandalorianowi za wykonanie zadania i każe go zestrzelić. Okazuje się, że Mandalorianin to przewidział i podłożył Quinowi nadajnik. Na X-wingach przylatuje trójka pilotów Nowej Republiki, którzy niszczą stację kosmiczną. Okazuje się, że Mayfield, Burg i Xi'an zostali oszczędzeni i są uwięzieni we wspólnej celi.", "viewed": true}, {"id": 7, "title": "Chapter 7: The Reckoning", "description": "Mandalorianin otrzymuje wiadomość od Greefa Kargi. Miasto Kargi zostało opanowane przez postimperialne wojsko dowodzone przez Klienta, który desperacko chce zdobyć Dziecko. Karga proponuje, aby Mandalorianin wykorzystał Dziecko jako przynętę, aby zabić Klienta i uwolnić miasto. Wyczuwając pułapkę, Mandalorianin rekrutuje Carę Dune i Kuiila, aby mu pomogli. Okazuje się, że Kuiil odratował i przeprogramował IG-11. Bohaterowie spotykają Kargę i jego towarzyszy na Nevarro i wyruszają z nimi do miasta. Podczas odpoczynku, zostają zaatakowani przez latające Mynocki. Karga zostaje ranny, lecz Dziecko używa Mocy, by go uleczyć. W zamian Karga strzela do swoich towarzyszy i wyjaśnia, że plan polegał na zabiciu Mandalorianina i zabraniu Dziecka siłą. Grupa formułuje nowy plan – Karga będzie udawać, że Cara schwytała Mandalorianina - i we troje idą do Klienta. Tymczasem Kuiil zabiera Dziecko z powrotem na statek. Podczas spotkania Klient otrzymuje wiadomość od Moffa Gideona, którego żołnierze otaczają budynek, otwierają ogień i zabijają Klienta. Gideon przybywa osobiście i oznajmia, że Dziecko wkrótce będzie w jego posiadaniu. Na pustyni poza miastem dwóch zwiadowców podąża za Kuiilem. Zabijają go i zabierają Dziecko.", "viewed": true}, {"id": 8, "title": "Chapter 8: Redemption", "description": "IG-11 odbija Dziecko od szturmowców. Mandalorianin, Greef Karga i Cara Dune są otoczeni przez szturmowców Moffa Gideona. Bohaterowie próbują uciec, lecz nie mają szans. Gideon wyjawia tożsamość Mandalorianina, nazywa się on Din Djarin. Przybywa IG-11 i pomaga uciec bohaterom. Din zostaje raniony w głowę przez Gideona. Ekipa znowu znajduje się w potrzasku. Dziecko używa Mocy i unicestwia szturmowca z miotaczem ognia. Greef, Cara i Dziecko uciekają kanałami do kryjówki Mandalorian. IG-11 ściąga hełm Dinowi i podaje mu bactę w sprayu. Robot i Mandalorianin dołączają do pozostałej części ekipy. Okazuje się, że wszyscy Mandalorianie ukrywający się na tej planecie zginęli. Przeżyła jedynie zbrojmistrzyni, która graweruje na zbroi Dina jego emblemat, daje mu plecak odrzutowy i nakazuje, by troszczył się o Dziecko i oddał go jego pobratymcom. Bohaterowie płyną na łódce podziemną rzeką lawy, lecz wpadają w zasadzkę szturmowców. IG-11 poświęca się i eksploduje, eliminując wroga. Zjawia się Gideon w myśliwcu TIE. Djarin używa plecaka odrzutowego i niszczy statek. Mandalorianin i Dziecko opuszczają planetę. Z rozbitego statku wychodzi Gideon z czarnym mieczem świetlnym – mandaloriańskim artefaktem.", "viewed": true}, {"id": 9, "title": "Chapter 9: The Marshal", "description": "Din Djarin zaczyna szukać innych Mandalorian, którzy, jak wierzy, mogą pomóc mu znaleźć Jedi, którym chce oddać Dziecko. Zostaje skierowany do Mos Pelgo w Tatooine. Tam spotyka Cobba Vantha, który nosi mandaloriańską zbroję. Vanth wyjaśnia, że ​​uwolnił swoje miasto spod kontroli Kolektywu Górniczego, używając tej zbroi, którą kupił od Jawów na pustyni. Miasto jest teraz często atakowane przez smoka krayt. Vanth zgadza się oddać pancerz w zamian za pomoc w zabiciu wielkiego drapieżnika. Mandalorianin aranżuje porozumienie między mieszkańcami Mos Pelgo i miejscowym klanem Tuskenów, aby wspólnie zabić smoka krayt, w zamian za pokój między obu grupami. Wywabiają potwora, który ostatecznie zostaje zabity przez Mandalorianina. Din Djarin odjeżdża ze zbroją, obserwowany przez postać z bliznami.", "viewed": false}, {"id": 10, "title": "Chapter 10: The Passenger", "description": "Po zabiciu grupy łowców nagród, którzy chcących schwytać Dziecko, Din Djarin wraca do Mos Eisley. W zamian za informacje o innych Mandalorianach, zgadza się zabrać pasażerkę i jej skrzek do jej męża, który ma zapłodnić jaja. Ze względu na wrażliwość skrzeku muszą podróżować z prędkością podświetlną. Podczas podróży napotykają patrol Nowej Republiki, przed którym (ze wzgl. na wydarzenia z odc. \"The Prisoner\") uciekają na lodową planetę, uszkadzając statek. Zostają zaatakowani przez rój pająków, przed którymi ratują ich piloci X-wingów, którym udało się ich znaleźć. Wyjaśniają, że mimo uwolnienia więźnia mężczyzna ma też zasługi dla Republiki i pozwalają mu odlecieć w dalszą drogę.", "viewed": false}, {"id": 11, "title": "Chapter 11: The Heiress", "description": "Mandalorianin dociera z pasażerką do jej męża i płynie statkiem rybackim szukając swych pobratymców, lecz to oni jego znajdują, gdy załoga okrętu próbuje zabić Din Djarina. Przywódczyni Mandalorian, Bo-Katan Kryze, prosi o pomoc w przejęciu broni z imperialnego frachtowca w zamian za informacje o Jedi. Po wejściu na statek okazuje się, że kobieta chce go przejąć i zdobyć informacje o mieczu, który ma Gideon. Udaje im się zdobyć statek, lecz nie informacje, a Din Djarin woli wrócić do Dziecka, niż z nimi lecieć. Kryze kieruje go do Ahsoki Tano w mieście Calodan na leśnej planecie Corvus. Po częściowej naprawie swego statku Mandalorianin i Dziecko ruszają w dalszą drogę.", "viewed": false}, {"id": 12, "title": "Chapter 12: The Siege", "description": "Mandalorianin i Dziecko zatrzymują się na Nevarro, by dokończyć naprawę statku. Podczas gdy jego statek jest naprawiany, Mandalorianin, Greef Karga i Cara Dune atakują imperialną bazę na Nevarro. Uszkadzają reaktor, by ją zniszczył, dając im jednak czas na ucieczkę. Odkrywają przy tym, że w bazie prowadzono eksperymenty z klonowaniem i pobraną krwią Dziecka. Uciekają stamtąd ścigani przez szturmowców, których udaje im się wyeliminować. Następnie Mandalorianin i Dziecko udają się na Corvus, nieświadomi, że imperialny agent umieścił na statku nadajnik.", "viewed": false}, {"id": 13, "title": "Chapter 13: The Jedi", "description": "Bohaterowie docierają do Calodan, gdzie rządząca miastem Morgan Elsbeth proponuje Mandalorianinowi pikę z beskaru za zabicie Ahsoki. Din Djarin odnajduje Jedi, która, komunikując się telepatycznie z Dzieckiem, dowiaduje się, że ma ono na imię Grogu i zostało uratowane przed rzezią Świątyni Jedi. Ahsoka zgadza się trenować je, jeśli Mandalorianin pomoże jej pokonać Elsbeth. Zabijają strażników miasta, uwalniają zakładników i konfrontują się z Elsbeth, którą Ahsoka zmusza do ujawnienia lokalizacji jej pana: Wielkiego Admirała Thrawna. Jedi nie chce jednak szkolić Dziecka, gdyż wyczuwa, że jest ono zbyt przywiązane do Mandalorianina. Kieruje bohaterów do ruin starożytnej świątyni na planecie Tython, gdzie Grogu mógłby użyć Mocy, aby skontaktować się z innym Jedi.", "viewed": false}, {"id": 14, "title": "Chapter 14: The Tragedy", "description": "Mandalorianin przybywa z Grogu na Tython i znajduje świątynię na wzgórzu. Umieszcza Grogu na środku, aby mógł wybrać swoją ścieżkę. Grogu zaczyna medytować, generując wokół siebie ochronne pole Mocy. Wkrótce przybywa Boba Fett, razem z Fennec Shand, której uratował życie na Tatooine, i żąda zwrotu swojej mandaloriańskiej zbroi, oferując w zamian pomoc w ochronie Grogu. Przybywają dwa promy pełne szturmowców, którzy próbują schwytać dziecko. Fett, Shand i Din Djarin łączą siły, stopniowo likwidując wroga. Gdy odnoszą pozorne zwycięstwo, Moff Gideon niszczy statek Mandalorianina strzałem ze swego okręt i wysyła latające droidy, które porywają Dziecko, po czym odlatuje. Fett i Shand zgadzają się pomóc Mandalorianinowi uratować Dziecko, aby spłacić dług. Din Djarin prosi Carę Dune o pomoc w uwolnieniu Mayfelda, potrzebnego by odbić Grogu. Będąc pod wrażeniem mocy Grogu, Moff Gideon informuje dr Pershinga, że ​​dawca jest dostępny.", "viewed": false}, {"id": 15, "title": "Chapter 15: The Believer", "description": "Migs Mayfeld, tymczasowo zwolniony z więzienia przez Carę Dune, leci z nią, Djarinem, Fettem i Shand na Morak, gdzie w imperialnym centrum wydobywczym znajduje się terminal, z którego można namierzyć statek Gideona. Uprowadzają transport rhydonium i, odpierając ataki piratów, udaje im się dotrzeć do zakładu górniczego. Mandalorianin pobiera współrzędne z terminala, ale w tym celu musi pokazać swoją twarz, a Mayfeld zabija swego dawnego dowódcę - zbrodniarza wojennego Valina Hessa. Uciekają z ośrodka niszcząc przy tym wybuchowe rhydonium. Dune pozwala Mayfeldowi odejść wolno, a Djarin kontaktuje się z Gideonem, oznajmiając, że odzyska Grogu.", "viewed": false}, {"id": 16, "title": "Chapter 16: The Rescue", "description": "Bohaterowie przechwytują prom dra Pershinga i łączą siły z Bo-Katan Kryze, by zaatakować okręt Gideona. Razem dostają się na jego pokład zdobytym promem, udając, że są ścigani przez Fetta. Mandalorianin kieruje się do Grogu, po drodze wyrzucając oddział bojowych droidów (zwanych Mrocznymi Szturmowcami) w próżnię. Reszta grupy udaje się na mostek eliminując szturmowców, nie znajdują tam jednak Gideona, który bierze Dziecko na zakładnika. Din Djarin pokonuje go w walce i doprowadza na mostek, lecz droidy dostają się z powrotem na statek, po czym próbują się przebić przez drzwi pancerne, za którymi chronią się bohaterowie. Gdy metal wyraźnie już ustępuje, na okręt dociera pojedynczy X-wing, a jego pasażer zaczyna niszczyć droidy, posługując się mieczem świetlnym i Mocą. Okazuje się, że tym Jedi jest Luke Skywalker, z którym skontaktował się Grogu. Djarin przekazuje Dziecko w ręce Luke'a, aby ten go szkolił i chronił. Później, Boba Fett i Fennec Shand zjawiają się w dawnym pałacu Jabby na Tatooine. Eliminują całą ochronę. Bobba zabija siedzącego na tronie Biba Fortunę i zajmuje jego miejsce.", "viewed": false}]